<template>
    <div class="box">
        <pos-box :level="1" :roteType="'Y'" :textArry="monthText" />
        <pos-box :level="2" :roteType="'D'" :textArry="dayText" />
        <pos-box :level="3" :roteType="'H'"  :textArry="hourText" />
        <pos-box :level="4" :roteType="'M'"  :textArry="minuteText" />
        <pos-box :level="5" :roteType="'S'" :deg="deg"  :textArry="secondsText" />
        
    </div>
</template>

<script>
import posBox from "../../components/posbox";
export default {
    components: {
        posBox,
    },
    data() {
        return {
            monthText: ["壹月", "贰月", "叁月", "肆月", "伍月", "陆月", "柒月", "捌月", "玖月", "拾月", "拾壹月", "拾贰月"],
            dayText: ["壹号", "贰号", "叁号", "肆号", "伍号", "陆号", "柒号", "捌号", "玖号", "拾号", "拾壹号", "拾贰号", "拾叁号", "拾肆号", "拾伍号", "拾陆号", "拾柒号", "拾捌号", "拾玖号", "贰拾号", "贰拾壹号", "贰拾贰号", "贰拾叁号", "贰拾肆号", "贰拾伍号", "贰拾陆号", "贰拾柒号", "贰拾捌号", "贰拾玖号", "叁拾号", "叁拾壹号"],
            hourText :["零时","壹时", "两时", "叁时", "肆时", "伍时", "陆时", "柒时", "捌时", "玖时", "拾时", "拾壹时", "拾贰时","拾叁时", "拾肆时", "拾伍时", "拾陆时", "拾柒时", "拾捌时", "拾玖时", "贰拾时", "贰拾壹时", "贰拾贰时", "贰拾叁时"],
            minuteText : ["零分","壹分", "贰分", "叁分", "肆分", "伍分", "陆分", "柒分", "捌分", "玖分", "拾分", "拾壹分", "拾贰分", "拾叁分", "拾肆分", "拾伍分", "拾陆分", "拾柒分", "拾捌分", "拾玖分", "贰拾分", "贰拾壹分", "贰拾贰分", "贰拾叁分", "贰拾肆分", "贰拾伍分", "贰拾陆分", "贰拾柒分", "贰拾捌分", "贰拾玖分", "叁拾分", "叁拾壹分", "叁拾贰分", "叁拾叁分", "叁拾肆分", "叁拾伍分", "叁拾陆分", "叁拾柒分", "叁拾捌分", "叁拾玖分", "肆拾分", "肆拾壹分", "肆拾贰分", "肆拾叁分", "肆拾肆分", "肆拾伍分", "肆拾陆分", "肆拾柒分", "肆拾捌分", "肆拾玖分", "伍拾分", "伍拾壹分", "伍拾贰分", "伍拾叁分", "伍拾肆分", "伍拾伍分", "伍拾陆分", "伍拾柒分", "伍拾捌分", "伍拾玖分"],
            secondsText : ["零","壹", "贰", "叁", "肆", "伍", "陆", "柒", "捌", "玖", "拾", "拾壹", "拾贰", "拾叁", "拾肆", "拾伍", "拾陆", "拾柒", "拾捌", "拾玖", "贰拾", "贰拾壹", "贰拾贰", "贰拾叁", "贰拾肆", "贰拾伍", "贰拾陆", "贰拾柒", "贰拾捌", "贰拾玖", "叁拾", "叁拾壹", "叁拾贰", "叁拾叁", "叁拾肆", "叁拾伍", "叁拾陆", "叁拾柒", "叁拾捌", "叁拾玖", "肆拾", "肆拾壹", "肆拾贰", "肆拾叁", "肆拾肆", "肆拾伍", "肆拾陆", "肆拾柒", "肆拾捌", "肆拾玖", "伍拾", "伍拾壹", "伍拾贰", "伍拾叁", "伍拾肆", "伍拾伍", "伍拾陆", "伍拾柒", "伍拾捌", "伍拾玖"],
            deg:1
        };
    },
   
};
</script>

<style>
.box {
    width: 100%;
    height: 100%;
    position: relative;
    overflow: hidden;
}
</style>
